99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_raw_tx/esp32_mquickjs_wifi_raw_tx.c
#include "esp32_mquickjs_wifi_frame_type.h"
#include "esp32_mquickjs_wifi_raw_tx.h"
#include "esp32_mquickjs_js_macros.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
#include "esp32_mquickjs_wifi_radio.h"
#include "esp32_mquickjs_wifi_raw_tx_lane.h"
#include "esp32_mquickjs_wifi_raw_tx_session.h"
#include "esp32_mquickjs_wifi_raw_tx_periodic_job.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_native_status.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_memory.h"
#include "utils/esp32_mquickjs_byte_source.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "esp_system.h"
#include <stdatomic.h>
#include <string.h>

typedef struct {
    esp32_mquickjs_wifi_raw_tx_interface_t interface;
    uint8_t channel;
    bool driver_sequence;
    uint32_t timeout_ms;
} raw_tx_options_t;

struct esp32_mquickjs_future_driver_state {
    raw_tx_options_t options;
    uint8_t *bytes;
    size_t length;
    esp32_mquickjs_wifi_radio_lease_t lease;
    esp32_mquickjs_wifi_raw_tx_token_t native_token;
    esp32_mquickjs_wifi_raw_tx_broker_status_t result;
    esp32_mquickjs_wifi_raw_tx_validation_t validation;
    esp_err_t error;
    const char *stage;
    uint8_t channel;
    esp32_mquickjs_wifi_raw_tx_lane_token_t lane;
    bool submitted, lane_acquired, schedule_failed;
    atomic_bool worker_done, cancel_requested;
};

/* One native retirement slot, independent of Future storage and JS roots.
 * A Future lane cannot start the next send until this exact owner is cleaned.
 * No runtime/task/JS pointer is retained by this slot or the SDK callback. */
static portMUX_TYPE s_retired_lock = portMUX_INITIALIZER_UNLOCKED;
static struct {
    esp32_mquickjs_wifi_radio_lease_t lease;
    esp32_mquickjs_wifi_raw_tx_token_t token;
    esp32_mquickjs_wifi_raw_tx_lane_token_t lane;
    bool active, busy, stop_pending;
    esp_err_t error;
    const char *stage;
    int64_t next_retry_us;
} s_retired;
static const char s_raw_tx_lane;

static bool raw_tx_retired_pending(void)
{
    portENTER_CRITICAL(&s_retired_lock);
    bool active = s_retired.active;
    portEXIT_CRITICAL(&s_retired_lock);
    return active;
}

static void raw_tx_cleanup_worker(void *opaque)
{
    (void)opaque;
    portENTER_CRITICAL(&s_retired_lock);
    esp32_mquickjs_wifi_radio_lease_t lease = s_retired.lease;
    esp32_mquickjs_wifi_raw_tx_token_t token = s_retired.token;
    esp32_mquickjs_wifi_raw_tx_lane_token_t lane = s_retired.lane;
    bool stop_pending = s_retired.stop_pending;
    portEXIT_CRITICAL(&s_retired_lock);
    esp_err_t error = ESP_OK;
    const char *stage = NULL;
    if (token.identity != 0U && !esp32_mquickjs_wifi_radio_raw_tx_retire(&lease, &token)) {
        error = ESP_ERR_INVALID_STATE;
        stage = "native-completion";
    }
    if (token.identity == 0U && (lease.acquired || stop_pending)) {
        error = esp32_mquickjs_wifi_radio_release_and_stop_idle(&lease);
        if (error != ESP_OK || lease.acquired) stage = "radio-release-stop";
        if (lease.acquired && error == ESP_OK) error = ESP_ERR_INVALID_STATE;
        stop_pending = error != ESP_OK;
    }
    if (error == ESP_OK && token.identity == 0U && !lease.acquired && !stop_pending &&
        lane.identity != 0U && !esp32_mquickjs_wifi_raw_tx_lane_release(&lane)) {
        error = ESP_ERR_INVALID_STATE;
        stage = "lane-release";
    }
    int64_t retry = esp_timer_get_time() + ESP32_MQUICKJS_WIFI_RAW_TX_CLEANUP_RETRY_US;
    portENTER_CRITICAL(&s_retired_lock);
    s_retired.lease = lease;
    s_retired.token = token;
    s_retired.lane = lane;
    s_retired.stop_pending = stop_pending;
    s_retired.error = error;
    s_retired.stage = stage;
    s_retired.active = token.identity != 0U || lease.acquired || lane.identity != 0U || error != ESP_OK;
    s_retired.next_retry_us = retry;
    s_retired.busy = false;
    portEXIT_CRITICAL(&s_retired_lock);
}

static bool raw_tx_service(JSContext *ctx, esp32_mquickjs_runtime_t *runtime, void *opaque)
{
    (void)ctx; (void)runtime; (void)opaque;
    bool ap_handled = esp32_mquickjs_wifi_raw_tx_sessions_runtime_service();
    bool periodic_handled = esp32_mquickjs_wifi_raw_tx_periodic_jobs_service();
    int64_t now = esp_timer_get_time();
    portENTER_CRITICAL(&s_retired_lock);
    bool submit = s_retired.active && !s_retired.busy && now >= s_retired.next_retry_us;
    if (submit) s_retired.busy = true;
    portEXIT_CRITICAL(&s_retired_lock);
    if (!submit) {
        bool sessions_handled = esp32_mquickjs_wifi_raw_tx_sessions_service();
        return ap_handled || periodic_handled || sessions_handled;
    }
    if (!esp32_mquickjs_submit_background_worker(raw_tx_cleanup_worker, NULL)) {
        portENTER_CRITICAL(&s_retired_lock);
        s_retired.busy = false;
        s_retired.next_retry_us = now + ESP32_MQUICKJS_WIFI_RAW_TX_CLEANUP_RETRY_US;
        portEXIT_CRITICAL(&s_retired_lock);
        return ap_handled || periodic_handled;
    }
    (void)esp32_mquickjs_wifi_raw_tx_sessions_service();
    return true;
}

bool esp32_mquickjs_prepare_wifi_raw_tx_runtime_destroy(void)
{
    esp32_mquickjs_wifi_raw_tx_sessions_request_close();
    (void)raw_tx_service(NULL, NULL, NULL);
    return !raw_tx_retired_pending() && esp32_mquickjs_wifi_raw_tx_sessions_drained();
}

static JSValue raw_tx_error(JSContext *ctx, const char *code, esp_err_t error,
    const char *stage, esp32_mquickjs_wifi_raw_tx_validation_t validation)
{
    JSGCRef ref;
    JSValue *details = JS_PushGCRef(ctx, &ref);
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "native",
            esp32_mquickjs_native_code_to_js(ctx, "esp_err_t", error, esp_err_to_name(error))) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "stage", stage ? JS_NewString(ctx, stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "validationCode", JS_NewUint32(ctx, validation))) {
        JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
    }
    JSValue result = esp32_mquickjs_throw_native_error(ctx, code, "wifi.rawTx.send",
        "Raw TX did not complete; inspect wifi.status().radio.rawTx for native ownership", *details);
    JS_PopGCRef(ctx, &ref);
    return result;
}

static bool raw_tx_capture_options(JSContext *ctx, JSValue value, raw_tx_options_t *output)
{
    static const char *const keys[] = {"interface", "channel", "sequenceControl", "timeoutMs"};
    static const char *const interfaces[] = {"station", "access-point"};
    static const char *const sequences[] = {"driver", "application"};
    static const char *const current[] = {"current"};
    raw_tx_options_t options = {.driver_sequence = true, .timeout_ms = ESP32_MQUICKJS_WIFI_RAW_TX_DEFAULT_TIMEOUT_MS};
    if (JS_IsUndefined(value)) { *output = options; return true; }
    JSGCRef root_ref, field_ref;
    JSValue *root = JS_PushGCRef(ctx, &root_ref), *field = JS_PushGCRef(ctx, &field_ref);
    *root = value;
    bool ok = false;
    if (!esp32_mquickjs_validate_plain_options(ctx, *root, "wifi.rawTx.send", keys, 4)) goto done;
    size_t choice;
    uint32_t number;
    *field = JS_GetPropertyStr(ctx, *root, "interface");
    if (JS_IsException(*field)) goto done;
    if (!JS_IsUndefined(*field)) {
        if (!esp32_mquickjs_value_to_enum(ctx, *field, interfaces, 2, &choice)) goto invalid;
        options.interface = choice;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        if (options.interface == ESP32_MQUICKJS_WIFI_RAW_TX_ACCESS_POINT) goto invalid;
#endif
    }
    *field = JS_GetPropertyStr(ctx, *root, "channel");
    if (JS_IsException(*field)) goto done;
    if (!JS_IsUndefined(*field)) {
        if (JS_IsString(ctx, *field)) {
            if (!esp32_mquickjs_value_to_enum(ctx, *field, current, 1, &choice)) goto invalid;
        } else {
            if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 177, &number)) goto invalid;
            if (number > 14) {
#if CONFIG_SOC_WIFI_SUPPORT_5G
                if (esp32_mquickjs_wifi_radio_5ghz_channel_bit(number) == 0) goto invalid;
#else
                goto invalid;
#endif
            }
            options.channel = number;
        }
    }
    *field = JS_GetPropertyStr(ctx, *root, "sequenceControl");
    if (JS_IsException(*field)) goto done;
    if (!JS_IsUndefined(*field)) {
        if (!esp32_mquickjs_value_to_enum(ctx, *field, sequences, 2, &choice)) goto invalid;
        options.driver_sequence = choice == 0;
    }
    *field = JS_GetPropertyStr(ctx, *root, "timeoutMs");
    if (JS_IsException(*field)) goto done;
    if (!JS_IsUndefined(*field) && !esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, INT32_MAX, &options.timeout_ms)) goto invalid;
    *output = options;
    ok = true;
    goto done;
invalid:
    JS_ThrowTypeError(ctx, "invalid wifi.rawTx.send options");
done:
    JS_PopGCRef(ctx, &field_ref); JS_PopGCRef(ctx, &root_ref);
    return ok;
}

