99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_raw_tx/esp32_mquickjs_wifi_raw_tx.c
bool esp32_mquickjs_wifi_raw_tx_capture_bytes(JSContext *ctx, JSGCRef *value,
    const char *operation, uint8_t **bytes, size_t *byte_length)
{
    if (value == NULL || operation == NULL || bytes == NULL || byte_length == NULL ||
        *bytes != NULL || *byte_length != 0U) {
        JS_ThrowInternalError(ctx, "invalid Raw TX capture output"); return false;
    }
    const uint8_t *data = NULL;
    size_t length = 0;
    bool leased = false, ok = false;
    JSGCRef field_ref;
    JSValue *field = JS_PushGCRef(ctx, &field_ref);
    if (JS_GetClassID(ctx, value->val) == JS_CLASS_BYTE_VIEW) {
        if (!esp32_mquickjs_byte_view_acquire_read(ctx, value->val, operation, &data, &length)) goto done;
        leased = true;
    } else {
        if (JS_GetClassID(ctx, value->val) < 0) goto invalid;
        *field = JS_GetPropertyStr(ctx, value->val, "length");
        if (JS_IsException(*field)) goto done;
        uint32_t count;
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, ESP32_MQUICKJS_WIFI_RAW_TX_MIN_FRAME_BYTES, ESP32_MQUICKJS_WIFI_RAW_TX_MAX_FRAME_BYTES, &count)) goto invalid;
        length = count;
    }
    if (length < ESP32_MQUICKJS_WIFI_RAW_TX_MIN_FRAME_BYTES || length > ESP32_MQUICKJS_WIFI_RAW_TX_MAX_FRAME_BYTES) goto invalid;
    (*bytes) = esp32_mquickjs_memory_wireless_alloc("wifi.raw-tx", length, ESP32_MQUICKJS_MEMORY_EXTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_TX);
    if ((*bytes) == NULL) { JS_ThrowOutOfMemory(ctx); goto done; }
    (*byte_length) = length;
    if (leased) memcpy((*bytes), data, length);
    else for (uint32_t i = 0; i < length; ++i) {
        *field = JS_GetPropertyUint32(ctx, value->val, i);
        if (JS_IsException(*field)) goto done;
        uint32_t byte;
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, 0, 255, &byte)) goto invalid;
        (*bytes)[i] = byte;
    }
    ok = true;
    goto done;
invalid:
    JS_ThrowTypeError(ctx, "%s expects a 24-1500 byte ByteSource", operation);
done:
    if (leased) esp32_mquickjs_byte_view_release_read(ctx, value->val);
    JS_PopGCRef(ctx, &field_ref);
    return ok;
}

static bool raw_tx_capture_bytes(JSContext *ctx, JSGCRef *value,
    esp32_mquickjs_future_driver_state_t *state)
{
    return esp32_mquickjs_wifi_raw_tx_capture_bytes(ctx, value, "wifi.rawTx.send", &state->bytes, &state->length);
}

static bool raw_tx_capture(JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **output)
{
    (void)this_ref;
    *output = NULL;
    if (argc < 1 || argc > 2) { JS_ThrowTypeError(ctx, "wifi.rawTx.send expects frame and optional options"); return false; }
    raw_tx_options_t options;
    if (!raw_tx_capture_options(ctx, argc > 1 ? argv[1].val : JS_UNDEFINED, &options)) return false;
    esp32_mquickjs_future_driver_state_t *state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) { JS_ThrowOutOfMemory(ctx); return false; }
    state->options = options;
    atomic_init(&state->worker_done, false);
    atomic_init(&state->cancel_requested, false);
    if (!raw_tx_capture_bytes(ctx, &argv[0], state)) goto fail;
    esp32_mquickjs_wifi_raw_tx_validation_policy_t policy = {.interface = options.interface, .driver_sequence = options.driver_sequence};
    esp32_mquickjs_wifi_raw_tx_validated_frame_t frame;
    state->validation = esp32_mquickjs_wifi_raw_tx_validate(state->bytes, state->length, &policy, &frame);
    if (state->validation != ESP32_MQUICKJS_WIFI_RAW_TX_VALID) {
        raw_tx_error(ctx, "WIFI_RAW_TX_INVALID_FRAME", ESP_ERR_INVALID_ARG, "capture", state->validation);
        goto fail;
    }
    *output = state;
    return true;
fail:
    esp32_mquickjs_memory_payload_free(state->bytes);
    esp32_mquickjs_memory_payload_free(state);
    return false;
}

static void raw_tx_send_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;
    if (!atomic_load_explicit(&state->cancel_requested, memory_order_acquire)) {
        state->stage = "radio-acquire";
        state->error = esp32_mquickjs_wifi_radio_raw_tx_acquire(state->options.interface,
            state->options.channel, NULL, &state->lease, &state->channel);
        if (state->error == ESP_OK && !atomic_load_explicit(&state->cancel_requested, memory_order_acquire)) {
            state->stage = "submit";
            state->error = esp32_mquickjs_wifi_radio_raw_tx_submit(&state->lease, state->options.interface,
                state->options.driver_sequence, state->bytes, state->length, &state->native_token,
                &state->validation, &state->channel);
        }
    }
    /* Final access to state: the worker queue has no runtime wake/context and
     * the Future may release state as soon as it observes this publication. */
    atomic_store_explicit(&state->worker_done, true, memory_order_release);
}

static void raw_tx_schedule(esp32_mquickjs_future_driver_state_t *state)
{
    if (state->submitted || state->schedule_failed || atomic_load_explicit(&state->cancel_requested, memory_order_acquire)) return;
    (void)raw_tx_service(NULL, NULL, NULL);
    if (raw_tx_retired_pending()) return;
    if (state->lane.identity == 0U) {
        esp32_mquickjs_wifi_raw_tx_lane_result_t admission = esp32_mquickjs_wifi_raw_tx_lane_request(&state->lane);
        if (admission == ESP32_MQUICKJS_WIFI_RAW_TX_LANE_FULL) return;
        if (admission != ESP32_MQUICKJS_WIFI_RAW_TX_LANE_OK) {
            state->schedule_failed = true;
            state->error = ESP_ERR_INVALID_STATE;
            state->stage = admission == ESP32_MQUICKJS_WIFI_RAW_TX_LANE_EXHAUSTED ? "lane-identity-exhausted" : "lane-request";
            return;
        }
    }
    if (!state->lane_acquired) state->lane_acquired = esp32_mquickjs_wifi_raw_tx_lane_acquire(&state->lane);
    if (!state->lane_acquired) return;
    /* Runtime-free worker items avoid a delayed pool wake referencing a runtime
     * after terminal state publication. Future's normal polling observes done. */
    state->submitted = esp32_mquickjs_submit_background_worker(raw_tx_send_worker, state);
}

static bool raw_tx_start(JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token, esp32_mquickjs_future_driver_state_t *state)
{
    (void)ctx; (void)runtime; (void)token;
    raw_tx_schedule(state);
    return true;
}

static esp32_mquickjs_future_poll_t raw_tx_poll(esp32_mquickjs_future_driver_state_t *state)
{
    raw_tx_schedule(state);
    if (state->submitted && !atomic_load_explicit(&state->worker_done, memory_order_acquire)) return ESP32_MQUICKJS_FUTURE_PENDING;
    if (atomic_load_explicit(&state->cancel_requested, memory_order_acquire)) return ESP32_MQUICKJS_FUTURE_READY;
    if (state->schedule_failed) return ESP32_MQUICKJS_FUTURE_READY;
    if (!state->submitted) return ESP32_MQUICKJS_FUTURE_PENDING;
    if (state->error != ESP_OK) return ESP32_MQUICKJS_FUTURE_READY;
    esp32_mquickjs_wifi_raw_tx_broker_status(&state->result);
    if (state->result.token.identity != state->native_token.identity ||
        state->result.token.generation != state->native_token.generation ||
        state->result.token.radio_lease_identity != state->native_token.radio_lease_identity ||
        state->native_token.identity == 0U) {
        state->error = ESP_ERR_INVALID_STATE; state->stage = "completion-identity";
        return ESP32_MQUICKJS_FUTURE_READY;
    }
    if (state->result.native_terminated) {
        state->error = ESP_ERR_INVALID_STATE; state->stage = "native-terminated";
        return ESP32_MQUICKJS_FUTURE_READY;
    }
    if (state->result.correlation_fault) {
        state->error = ESP_ERR_INVALID_STATE; state->stage = "completion-correlation";
        return ESP32_MQUICKJS_FUTURE_READY;
    }
    return state->result.driver_completed && state->result.callbacks_active == 0U
        ? ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
}

static int raw_tx_frame_control(esp32_mquickjs_wifi_raw_tx_frame_type_t type)
{
    static const uint8_t controls[] = {
        [ESP32_MQUICKJS_WIFI_RAW_TX_BEACON] = 0x80,
        [ESP32_MQUICKJS_WIFI_RAW_TX_PROBE_REQUEST] = 0x40,
        [ESP32_MQUICKJS_WIFI_RAW_TX_PROBE_RESPONSE] = 0x50,
        [ESP32_MQUICKJS_WIFI_RAW_TX_ACTION] = 0xd0,
        [ESP32_MQUICKJS_WIFI_RAW_TX_NON_QOS_DATA] = 0x08,
#if defined(ESP32_MQUICKJS_RAW_TX_EXTENDED_MANAGEMENT) && ESP32_MQUICKJS_RAW_TX_EXTENDED_MANAGEMENT
        [ESP32_MQUICKJS_WIFI_RAW_TX_ASSOCIATION_REQUEST] = 0x00,
        [ESP32_MQUICKJS_WIFI_RAW_TX_ASSOCIATION_RESPONSE] = 0x10,
        [ESP32_MQUICKJS_WIFI_RAW_TX_REASSOCIATION_REQUEST] = 0x20,
        [ESP32_MQUICKJS_WIFI_RAW_TX_REASSOCIATION_RESPONSE] = 0x30,
        [ESP32_MQUICKJS_WIFI_RAW_TX_TIMING_ADVERTISEMENT] = 0x60,
        [ESP32_MQUICKJS_WIFI_RAW_TX_ATIM] = 0x90,
        [ESP32_MQUICKJS_WIFI_RAW_TX_DISASSOCIATION] = 0xa0,
        [ESP32_MQUICKJS_WIFI_RAW_TX_AUTHENTICATION] = 0xb0,
        [ESP32_MQUICKJS_WIFI_RAW_TX_DEAUTHENTICATION] = 0xc0,
        [ESP32_MQUICKJS_WIFI_RAW_TX_ACTION_NO_ACK] = 0xe0,
#endif
    };
    return (unsigned)type < sizeof(controls) / sizeof(controls[0]) ? controls[type] : -1;
}

JSValue esp32_mquickjs_wifi_raw_tx_result_to_js(JSContext *ctx,
    const esp32_mquickjs_wifi_raw_tx_broker_status_t *native,
    esp32_mquickjs_wifi_raw_tx_interface_t interface, uint8_t channel)
{
    int frame_control = native != NULL ? raw_tx_frame_control(native->frame_type) : -1;
    if (native == NULL || !native->driver_accepted || !native->driver_completed || native->native_terminated || frame_control < 0) return JS_ThrowInternalError(ctx, "Raw TX result requires native acceptance, completion and a valid frame type");
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "sequence", JS_NewUint32(ctx, native->token.identity), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "radioGeneration", JS_NewUint32(ctx, native->token.generation), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "interface", JS_NewString(ctx, interface == ESP32_MQUICKJS_WIFI_RAW_TX_STATION ? "station" : "access-point"), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "channel", JS_NewUint32(ctx, channel), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "frameType", esp32_mquickjs_wifi_frame_type_to_js(ctx, (frame_control >> 2) & 3, frame_control >> 4), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "byteLength", JS_NewUint32(ctx, native->byte_length), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "submittedAtUs", JS_NewFloat64(ctx, (double)native->submitted_at_us), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "completedAtUs", JS_NewFloat64(ctx, (double)native->completion.callback_time_us), fail);
    int code = native->completion.raw_status;
    const char *status = code == WIFI_SEND_SUCCESS ? "success" : code == WIFI_SEND_FAIL ? "failed" : "unknown";
    const char *domain = "wifi_tx_status_t";
    const char *name = code == WIFI_SEND_SUCCESS ? "WIFI_SEND_SUCCESS" : code == WIFI_SEND_FAIL ? "WIFI_SEND_FAIL" : NULL;
    if (native->completion.mac_status_available) {
        /* Prefer the finer observation in the same native envelope. Its code
         * namespace changes too: descriptor 1 is success, SDK enum 1 is fail.
         * An unknown descriptor name must not erase the SDK completion status. */
        domain = "esp_wifi_tx_descriptor_status";
        code = native->completion.mac_status_byte;
        name = esp32_mquickjs_wifi_raw_tx_mac_status_name(native->completion.mac_status_byte);
    }
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "completion", esp32_mquickjs_tx_completion_to_js(ctx,
        true, status, domain, code, name), fail);
    const char *rate = native->driver_completed ? esp32_mquickjs_wifi_tx_rate_name(native->completion.raw_rate) : NULL;
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "rate", rate != NULL ? JS_NewString(ctx, rate) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "rawRate", JS_NewInt32(ctx, native->completion.raw_rate), fail);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

