99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_raw_tx/esp32_mquickjs_wifi_raw_tx.c
static JSValue raw_tx_finish(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state->error != ESP_OK) return raw_tx_error(ctx, "WIFI_RAW_TX_SEND_FAILED", state->error, state->stage, state->validation);
    if (raw_tx_frame_control(state->result.frame_type) < 0) return raw_tx_error(ctx, "WIFI_RAW_TX_SEND_FAILED", ESP_ERR_INVALID_STATE, "frame-type", state->validation);
    return esp32_mquickjs_wifi_raw_tx_result_to_js(ctx, &state->result, state->options.interface, state->channel);
}

static esp32_mquickjs_cancel_result_t raw_tx_cancel(esp32_mquickjs_future_driver_state_t *state)
{
    atomic_store_explicit(&state->cancel_requested, true, memory_order_release);
    /* Cancellation stops waiting; already submitted RF may still occur. Only
     * the Future-owned worker needs to finish before native ownership transfers. */
    return ESP32_MQUICKJS_CANCEL_REQUESTED;
}

static void raw_tx_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) return;
    if (state->native_token.identity != 0U) (void)esp32_mquickjs_wifi_raw_tx_broker_abandon(&state->native_token);
    /* A waiter never reached Radio. A grant with no acquired Radio lease is
     * also safe to return immediately, even when the worker queue is full. */
    if (state->lane.identity != 0U && !state->lane_acquired)
        (void)esp32_mquickjs_wifi_raw_tx_lane_withdraw(&state->lane);
    if (state->lane_acquired && !state->lease.acquired &&
        esp32_mquickjs_wifi_raw_tx_lane_release(&state->lane)) state->lane_acquired = false;
    if (state->lease.acquired || state->lane_acquired) {
        portENTER_CRITICAL(&s_retired_lock);
        /* The single Future lane admits sends only after this slot drains. */
        s_retired.lease = state->lease;
        s_retired.token = state->native_token;
        s_retired.lane = state->lane;
        s_retired.stop_pending = state->lease.acquired;
        s_retired.active = true;
        s_retired.error = ESP_OK;
        s_retired.stage = "native-completion";
        s_retired.next_retry_us = 0;
        portEXIT_CRITICAL(&s_retired_lock);
    }
    esp32_mquickjs_memory_payload_free(state->bytes);
    esp32_mquickjs_memory_payload_free(state);
    (void)raw_tx_service(NULL, NULL, NULL);
}

static uint32_t raw_tx_timeout(const esp32_mquickjs_future_driver_state_t *state)
{
    return state->options.timeout_ms;
}
static JSValue raw_tx_on_timeout(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state, uint32_t timeout_ms)
{
    (void)timeout_ms;
    atomic_store_explicit(&state->cancel_requested, true, memory_order_release);
    /* Worker-owned scalar fields are not read until worker_done. */
    return raw_tx_error(ctx, "WIFI_RAW_TX_TIMEOUT", ESP_ERR_TIMEOUT, "deadline", ESP32_MQUICKJS_WIFI_RAW_TX_VALID);
}
static esp32_mquickjs_resource_key_t raw_tx_resource(const esp32_mquickjs_future_driver_state_t *state)
{
    (void)state;
    return &s_raw_tx_lane;
}
static const esp32_mquickjs_future_driver_t s_raw_tx_driver = {
    .memory_owner = "wireless.future", .capture = raw_tx_capture, .start = raw_tx_start, .poll = raw_tx_poll, .finish = raw_tx_finish,
    .cancel = raw_tx_cancel, .destroy = raw_tx_destroy, .timeout_ms = raw_tx_timeout,
    .on_timeout = raw_tx_on_timeout, .resource_key = raw_tx_resource,
};

JSValue esp32_mquickjs_wifi_raw_tx_status(JSContext *ctx)
{
    esp32_mquickjs_wifi_raw_tx_broker_status_t native;
    esp32_mquickjs_wifi_raw_tx_broker_status(&native);
    esp32_mquickjs_wifi_raw_tx_lane_status_t lane;
    esp32_mquickjs_wifi_raw_tx_lane_status(&lane);
    esp32_mquickjs_wifi_raw_tx_sessions_status_t sessions;
    esp32_mquickjs_wifi_raw_tx_sessions_status(&sessions);
    esp32_mquickjs_wifi_raw_tx_periodic_jobs_status_t periodic;
    esp32_mquickjs_wifi_raw_tx_periodic_jobs_status(&periodic);
    portENTER_CRITICAL(&s_retired_lock);
    bool retired = s_retired.active;
    esp_err_t error = s_retired.error;
    const char *stage = s_retired.stage;
    portEXIT_CRITICAL(&s_retired_lock);
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "operationActive", JS_NewBool(native.operation_active), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "operationIdentity", native.operation_active || native.native_terminated ? JS_NewUint32(ctx, native.token.identity) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "radioGeneration", native.operation_active || native.native_terminated ? JS_NewUint32(ctx, native.token.generation) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "nativeTerminated", JS_NewBool(native.native_terminated), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "terminatedRadioGeneration", native.native_terminated ? JS_NewUint32(ctx, native.token.generation) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "quarantined", JS_NewBool(native.quarantined || native.registration_uncertain || native.unregister_written), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "correlationFault", JS_NewBool(native.correlation_fault), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "correlationFailureReason", native.correlation_failure_reason ? JS_NewString(ctx, native.correlation_failure_reason) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "correlationFailureIdentity", native.correlation_failure_identity ? JS_NewUint32(ctx, native.correlation_failure_identity) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "correlationFailureGeneration", native.correlation_failure_generation ? JS_NewUint32(ctx, native.correlation_failure_generation) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "invalidCallbacks", JS_NewUint32(ctx, native.invalid_callbacks), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "mismatchedCallbacks", JS_NewUint32(ctx, native.mismatched_callbacks), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "orphanCallbacks", JS_NewUint32(ctx, native.orphan_callbacks), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "duplicateCallbacks", JS_NewUint32(ctx, native.duplicate_callbacks), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "cleanupPending", JS_NewBool(native.native_terminated || retired || sessions.closing != 0U || periodic.cleanup_pending != 0U), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "cleanupStage", stage ? JS_NewString(ctx, stage) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "cleanupError", error != ESP_OK ? JS_NewInt32(ctx, error) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "submitError", native.submit_error != ESP_OK ? JS_NewInt32(ctx, native.submit_error) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "registrationError", native.cleanup_error != ESP_OK ? JS_NewInt32(ctx, native.cleanup_error) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "identityExhausted", JS_NewBool(native.identity_exhausted), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "laneIdentity", lane.active_identity ? JS_NewUint32(ctx, lane.active_identity) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "laneWaiters", JS_NewUint32(ctx, lane.waiting), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "laneIdentityExhausted", JS_NewBool(lane.identity_exhausted), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "liveSessions", JS_NewUint32(ctx, sessions.live), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "retainedClosedSessions", JS_NewUint32(ctx, sessions.closed), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "closingSessions", JS_NewUint32(ctx, sessions.closing), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "faultedSessions", JS_NewUint32(ctx, sessions.faulted), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "registeredSessionResults", JS_NewUint32(ctx, sessions.pending_results), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "registeredSessionFlushes", JS_NewUint32(ctx, sessions.pending_flushes), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "sessionErrorGeneration", sessions.error_generation ? JS_NewUint32(ctx, sessions.error_generation) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "sessionError", sessions.error ? JS_NewInt32(ctx, sessions.error) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "sessionStage", sessions.stage ? JS_NewString(ctx, sessions.stage) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "sessionCleanupError", sessions.cleanup_error ? JS_NewInt32(ctx, sessions.cleanup_error) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "sessionCleanupStage", sessions.cleanup_stage ? JS_NewString(ctx, sessions.cleanup_stage) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "periodicJobs", JS_NewUint32(ctx, periodic.live), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "retiredPeriodicJobs", JS_NewUint32(ctx, periodic.retired), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "faultedPeriodicJobs", JS_NewUint32(ctx, periodic.faulted), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "periodicCleanupPending", JS_NewUint32(ctx, periodic.cleanup_pending), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "periodicIdentityExhausted", JS_NewBool(periodic.identity_exhausted), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "periodicErrorGeneration", periodic.error_generation ? JS_NewUint32(ctx, periodic.error_generation) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "periodicError", periodic.error ? JS_NewInt32(ctx, periodic.error) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "periodicStage", periodic.stage ? JS_NewString(ctx, periodic.stage) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "periodicCleanupError", periodic.cleanup_error ? JS_NewInt32(ctx, periodic.cleanup_error) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "periodicCleanupStage", periodic.cleanup_stage ? JS_NewString(ctx, periodic.cleanup_stage) : JS_NULL, fail);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

JSValue js_wifi_raw_tx_send(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    JSGCRef global_ref, wifi_ref, module_ref, method_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref), *wifi = JS_PushGCRef(ctx, &wifi_ref);
    JSValue *module = JS_PushGCRef(ctx, &module_ref), *method = JS_PushGCRef(ctx, &method_ref);
    *global = JS_GetGlobalObject(ctx);
    *wifi = JS_IsException(*global) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *global, "wifi");
    *module = JS_IsException(*wifi) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *wifi, "rawTx");
    *method = JS_IsException(*module) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *module, "send");
    JSValue result = JS_IsException(*method) ? JS_EXCEPTION : esp32_mquickjs_future_call_and_wait(ctx,
        esp32_mquickjs_get_active_runtime(), *method, *module, argc, argv);
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &module_ref);
    JS_PopGCRef(ctx, &wifi_ref); JS_PopGCRef(ctx, &global_ref);
    return result;
}

JSValue js_wifi_raw_tx_capabilities(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argv;
    if (argc != 0) return JS_ThrowTypeError(ctx, "wifi.rawTx.capabilities expects no arguments");
    JSGCRef result_ref, child_ref, item_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref), *child = JS_PushGCRef(ctx, &child_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "apiVersion", JS_NewString(ctx, "wifi-raw-tx/1"), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "target", JS_NewString(ctx, CONFIG_IDF_TARGET), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "idfVersion", JS_NewString(ctx, esp_get_idf_version()), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "stability", JS_NewString(ctx, "candidate"), fail);
    *child = JS_NewArray(ctx, 0);
    if (JS_IsException(*child)) goto fail;
    *item = JS_NewString(ctx, "station");
    if (JS_IsException(*item) || JS_IsException(JS_SetPropertyUint32(ctx, *child, 0, *item))) goto fail;
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    *item = JS_NewString(ctx, "access-point");
    if (JS_IsException(*item) || JS_IsException(JS_SetPropertyUint32(ctx, *child, 1, *item))) goto fail;
#endif
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "interfaces", *child, fail);
    *child = JS_NewArray(ctx, 0);
    if (JS_IsException(*child)) goto fail;
    *item = JS_NewString(ctx, "station");
    if (JS_IsException(*item) || JS_IsException(JS_SetPropertyUint32(ctx, *child, 0, *item))) goto fail;
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    *item = JS_NewString(ctx, "access-point");
    if (JS_IsException(*item) || JS_IsException(JS_SetPropertyUint32(ctx, *child, 1, *item))) goto fail;
#endif
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "rateLeaseInterfaces", *child, fail);
    *child = JS_NewArray(ctx, 0);
    if (JS_IsException(*child)) goto fail;
    for (uint32_t i = 0; ; i++) {
        int control = raw_tx_frame_control((esp32_mquickjs_wifi_raw_tx_frame_type_t)i);
        if (control < 0) break;
        *item = esp32_mquickjs_wifi_frame_type_to_js(ctx, (control >> 2) & 3, control >> 4);
        if (JS_IsException(*item) || JS_IsException(JS_SetPropertyUint32(ctx, *child, i, *item))) goto fail;
    }
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "frameTypes", *child, fail);
    *child = JS_NewObject(ctx);
    if (JS_IsException(*child)) goto fail;
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "driverSequence", JS_TRUE, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "applicationSequence", JS_TRUE, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "txDoneCallback", JS_TRUE, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "fixedChannel", JS_TRUE, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "nativeQueue", JS_TRUE, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "batchAdmission", JS_TRUE, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "periodicTx", JS_TRUE, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "rateLease", JS_TRUE, fail);
#if CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C5
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "recovery", JS_TRUE, fail);
#else
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "recovery", JS_FALSE, fail);
#endif
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "callerFcs", JS_FALSE, fail);
#if defined(ESP32_MQUICKJS_RAW_TX_EXTENDED_MANAGEMENT) && ESP32_MQUICKJS_RAW_TX_EXTENDED_MANAGEMENT
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "extendedManagement", JS_TRUE, fail);
#else
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "extendedManagement", JS_FALSE, fail);
#endif
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "supports", *child, fail);
    *child = JS_NewObject(ctx);
    if (JS_IsException(*child)) goto fail;
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "minimumFrameBytes", JS_NewInt32(ctx, ESP32_MQUICKJS_WIFI_RAW_TX_MIN_FRAME_BYTES), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "maximumFrameBytes", JS_NewInt32(ctx, ESP32_MQUICKJS_WIFI_RAW_TX_MAX_FRAME_BYTES), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "maximumQueueCapacity", JS_NewInt32(ctx, ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_MAX_PACKETS), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "maximumBatchFrames", JS_NewInt32(ctx, ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_MAX_PACKETS), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "maximumQueueBytes", JS_NewInt32(ctx, ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_MAX_PACKETS * ESP32_MQUICKJS_WIFI_RAW_TX_MAX_FRAME_BYTES), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "maximumInFlight", JS_NewInt32(ctx, ESP32_MQUICKJS_WIFI_RAW_TX_DRIVER_MAX_IN_FLIGHT), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "maximumSessions", JS_NewInt32(ctx, ESP32_MQUICKJS_WIFI_RAW_TX_MAX_SESSIONS), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "maximumPendingResultsPerSession", JS_NewInt32(ctx, ESP32_MQUICKJS_WIFI_RAW_TX_MAX_RESULTS), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "maximumPendingFlushesPerSession", JS_NewInt32(ctx, ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_MAX_FLUSHES), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "minimumPeriodicIntervalUs", JS_NewInt32(ctx, ESP32_MQUICKJS_WIFI_RAW_TX_PERIODIC_MIN_INTERVAL_US), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, child, "maximumPeriodicJobs", JS_NewInt32(ctx, ESP32_MQUICKJS_WIFI_RAW_TX_MAX_PERIODIC_JOBS), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "limits", *child, fail);
    JS_PopGCRef(ctx, &item_ref); JS_PopGCRef(ctx, &child_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &item_ref); JS_PopGCRef(ctx, &child_ref); JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

bool esp32_mquickjs_init_wifi_raw_tx_runtime(JSContext *ctx, esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref, wifi_ref, module_ref, method_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref), *wifi = JS_PushGCRef(ctx, &wifi_ref);
    JSValue *module = JS_PushGCRef(ctx, &module_ref), *method = JS_PushGCRef(ctx, &method_ref);
    *global = JS_GetGlobalObject(ctx);
    *wifi = JS_IsException(*global) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *global, "wifi");
    *module = JS_IsException(*wifi) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *wifi, "rawTx");
    *method = JS_IsException(*module) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *module, "send");
    bool ok = !JS_IsException(*method) && esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_raw_tx_driver) &&
        esp32_mquickjs_register_async_poller(runtime, raw_tx_service, NULL) &&
        esp32_mquickjs_init_wifi_raw_tx_session_runtime(ctx, runtime) &&
        esp32_mquickjs_init_wifi_raw_tx_periodic_runtime(ctx, runtime) &&
        esp32_mquickjs_init_wifi_raw_tx_recovery_runtime(ctx, runtime);
    if (!ok && !JS_HasException(ctx)) JS_ThrowInternalError(ctx, "failed to register Raw TX runtime");
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &module_ref);
    JS_PopGCRef(ctx, &wifi_ref); JS_PopGCRef(ctx, &global_ref);
    return ok;
}
#endif
